0.1.0/tutorials/incompressible/simple/rotor_disk/0/nut
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       volScalarField;
  object      nut;
}

dimensions      [0 2 -1 0 0 0 0];
internalField   uniform 0;

boundaryField
{
  inlet
  {
    type            calculated;
    value           uniform 0;
  }
  outlet
  {
    type            calculated;
    value           uniform 0;
  }
  "slip.*"
  {
    type            slip;
  }
  #includeEtc "case_dicts/setConstraintTypes"
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
