0.1.0/tutorials/incompressible/simple/rotor_disk/0/omega
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       volScalarField;
  object      omega;
}

omegaInlet      10.0;
dimensions      [0 0 -1 0 0 0 0];
internalField   uniform $omegaInlet;

boundaryField
{
  inlet
  {
    type            fixedValue;
    value           uniform $omegaInlet;
  }
  outlet
  {
    type            inletOutlet;
    inletValue      uniform $omegaInlet;
    value           uniform $omegaInlet;
  }
  "slip.*"
  {
    type            slip;
  }
  #includeEtc "case_dicts/setConstraintTypes"
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
