0.1.0/tutorials/incompressible/simple/rotor_disk/system/controlDict
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  object      controlDict;
}

application     mousse-simple;
startFrom       startTime;
startTime       0;
stopAt          endTime;
endTime         1000;
deltaT          1;
writeControl    timeStep;
writeInterval   50;
purgeWrite      0;
writeFormat     ascii;
writePrecision   8;
writeCompression off;
timeFormat      general;
timePrecision   6;
runTimeModifiable true;

// vim: set ft=foam et sw=2 ts=2 sts=2:
