0.1.0/tutorials/incompressible/simple/rotor_disk/system/fvSchemes
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  object      fvSchemes;
}

ddtSchemes
{
  default         steadyState;
}
gradSchemes
{
  default         Gauss linear;
  limited         cellLimited Gauss linear 1;
  grad(U)         $limited;
  grad(k)         $limited;
  grad(omega)     $limited;
}
divSchemes
{
  default         none;
  div(phi,U)      bounded Gauss linearUpwind unlimited;
  turbulence      bounded Gauss linearUpwind limited;
  div(phi,k)      $turbulence;
  div(phi,omega)  $turbulence;
  div(phi,epsilon) $turbulence;
  div((nuEff*dev(T(grad(U))))) Gauss linear;
  div((nuEff*dev2(T(grad(U))))) Gauss linear;
}
laplacianSchemes
{
  default         Gauss linear corrected;
}
interpolationSchemes
{
  default         linear;
}
snGradSchemes
{
  default         corrected;
}
wallDist
{
  method meshWave;
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
